<?php

namespace App\Services;

use DB;

/**
 * Description of KeyWords
 *
 * @author lenovo
 */
class KeyWords {

    /**
     * 回复数据包
     */
    public static function wx_replay_data() {

        $data["1"] = "小纪猜你关心这些：\n[1]绑定攻略\n[2]推荐攻略\n[3]红包攻略\n[4]店员贷福利\n回复序号：体验更细致服务";

        $data["1-1"] = "小纪猜你关心这些：\n[1]关联的销售是什么？\n[2]门店一定要填写吗？\n[3]销售二维码是什么？\n[4]一定要扫描二维码才能注册佰仟经纪？\n[5]收不到验证码怎么办？\n[6]对手机号有什么要求？\n[7]可以更改绑定销售吗？\n";
        $data["1-1-1"] = "亲，您注册的时候，需要选择一个佰仟金融的销售人员作为认证您身份的初始依据，即使TA后续不在您所在的门店工作，绑定关系依然存在。\n";
        $data["1-1-2"] = "如果您不是佰仟合作商户门店销售员，门店可以不填写。\n";
        $data["1-1-3"] = "每位佰仟金融的销售人员都有一个名片二维码，您只需要扫描他的二维码，即可以手机号完成注册！\n";
        $data["1-1-4"] = "不用，您在未注册情况下，点击首页的“注册经纪人”，也可填写各项信息注册！\n";
        $data["1-1-5"] = "请反馈给您门店的销售人员，或拨打电话0755-88290608分机1639反馈问题！\n";
        $data["1-1-6"] = "需要能接收到验证码\n";
        $data["1-1-7"] = "不需要更改，佰仟金融的销售人员作为认证您身份的初始依据，即使TA后续不在您所在的门店工作，绑定关系依然存在。\n";


        $data["1-2"] = "小纪猜你关心这些：\n[1]什么样的客户可以推荐？\n[2]客户需要满足什么条件？\n[3]如何知道推荐结果？\n[4]怎么发送我推荐的客户？\n[5]填错了客户信息，销售可以修改吗？\n[6]二维码失效了还可以扫描吗？\n[7]一个客户会不会推给多个销售，重复做单？\n[8]多久才能知道推荐是否有效？\n";
        $data["1-2-1"] = "亲，只要您在日常销售过程中，接触到有分期购物需求的优质客户，都可以推荐给小纪哦！\n具体分两种：\n1. 消费分期，即分期购物需求，如购买iPhone6、iWatch等；\n2. 现金分期，即1w元以下的现金贷款需求；\n";
        $data["1-2-2"] = "被推荐的客户需要满足以下条件：\n1. 18-55周岁；\n2. 有固定工作；\n3. 能提供身份证、银行卡、8种第二证明之一（社保卡、医保卡、工牌、驾驶证、居住证、户口本、存折）\n4. 对现金分期客户，还需提供其他机构贷款（指捷信）及还款截图证明、运营商登记信息截图。\n5. 如果已经在佰仟申请过，需要过3个月才能继续申请。\n";
        $data["1-2-3"] = "请点击“推荐进度”，即可查看到你推荐的客户身份成单。如状态为“审核通过”，则表明成功办单。\n";
        $data["1-2-4"] = "您录入客户信息后，可通过三种方式将客户提交给销售人员做单哦！\n1. 引导销售面对面扫描二维码；\n2. 点击“提交给我关联的销售：XXX”按钮，销售人员将收到您的推荐！\n3. 点击“提交给我附近的销售”按钮，您最近的2位销售人员将收到您的推荐，但只有一位能够最终服务客户。\n";
        $data["1-2-5"] = "亲，如果您推荐的客户信息有误，您可以重新推荐一次，提交新的那一笔就可以，15分钟后原推荐将自动作废。\n";
        $data["1-2-6"] = "您推荐了一位客户，将会生成一个有效期为15分钟的订单二维码，超过15分钟未扫描，二维码将自动失效，您需要重新填写一次客户信息，并再次提交推荐，谢谢！\n";
        $data["1-2-7"] = "不会的，如果点击“提交给我附近的销售”按钮，您最近的2位销售人员将收到客户信息，但只有一位能够最终服务客户。\n";
        $data["1-2-8"] = "亲，我们后台需要半小时审核客户申请，您将在半小时后就知道推荐是否有效了哦~请点击微信的“推荐进度”菜单，即可查看到你推荐的客户身份成单。如状态为“审核通过”，则表明成功办单。您需要等待第二天合同“已注册”才具备奖励资格。\n";


        $data["1-3"] = "小纪猜你关心这些：\n[1]推荐了客户却没有红包？\n[2]红包的金额怎么计算？\n[3]红包会不会失效？\n[4]积分和等级有什么作用？\n";
        $data["1-3-1"] = "亲，您的推荐只是第一步，我们需要您推荐的客户顺利办单，您才可以拿到红包哦！一定要推荐优质的客户才可以，成功办单概率会大大增加！么么哒！\n";
        $data["1-3-2"] = "亲，您最终获得的红包金额将由以下因素决定：\n1. 相应销售人员配置的分红计划； \n2. 您的手气\n比如：销售人员A配置他每单分成15元，则您最多可以获得15元现金红包！当然也可能是11.00 、12.00 ……\n";
        $data["1-3-3"] = "亲，收到红包要快快领哦，不然过了24小时就领不了了呢！平时也没少抢红包吧，这个不用小纪说了吧\n";
        $data["1-3-4"] = "积分可以用来兑换商品！我们的积分规则是这样的：\n• 每推荐成功一单，积分奖励积分+10分；商品金额超过6000的+20分；\n• 推荐单但被拒绝或取消，积分奖励+2分；\n";


        $data["1-4"] = "小纪猜你关心这些：\n[1]什么是店员贷？\n[2]怎么申请店员贷？\n";
        $data["1-4-1"] = "佰仟店员贷，是专门为有小额用款需求的佰仟合作商户员工设计的纯信用借贷产品，仅针对与佰仟金融签约合作的商户员工开放。\n额度：5000-50000元\n期限范围：6-24期\n资料要求：身份证、劳动合同、在职证明、工作证、社保卡、居住证\n利率说明：月利率1%-1.5%\n";
        $data["1-4-2"] = "申请流程：\n1. 你可以通过佰仟店员贷申请员工贷款；\n2. 销售代表上门收集、检查客户提供的申请资料并提交申请；\n3. 审核通过后会在1到2个工作日之内将贷款打入客户银行卡中；\n4. 后续根据还款指引每月定期还款。\n";


        return $data;
    }

    public static function replay($openid, $keyword) {
        $replayData = self::wx_replay_data();
        $key = '';
        $prev_key_data = self::findReplay($openid);
        if (is_numeric($keyword)) {
            if (!empty($prev_key_data) && (time() - $prev_key_data['update_time'] ) < 120) {
                if (isset($replayData[$prev_key_data['content_item'] . '-' . $keyword])) {
                    $key = $prev_key_data['content_item'] . '-' . $keyword;
                } else {
                    
                }
            }
        }
        if (!$key) {
            if (false !== strpos('推荐|怎么推荐|客户|条件|推荐结果|查询办单', $keyword)) {
                $key = '1-2';
            } elseif (false !== strpos('激励|红包|奖励|积分|金额', $keyword)) {
                $key = '1-3';
            } elseif (false !== strpos('绑定|注册|验证码|二维码|攻略', $keyword)) {
                $key = '1-1';
            } elseif (false !== strpos('福利|贷款|分期', $keyword)) {
                $key = '1-4';
            } else {
                $key = '1';
            }
        }
        self::insertData($openid, $key);
        return $replayData[$key];
    }

    public static function findReplay($openid) {
        $info = DB::table('ag_replay')->where('option_id', $openid)->orderBy('id', 'desc')->first();
        if (!empty($info)) {
            $info = (array) $info;
        }
        return $info;
    }

    public static function insertData($openid, $key) {

        $info = DB::table('ag_replay')->where('option_id', $openid)->first();

        $data['option_id'] = $openid;
        $data['content_item'] = $key;
        $data['update_time'] = time();
        $query = DB::table('ag_replay');
        if (empty($info)) {
            $status = $query->insert($data);
        } else {
            $status = $query->where('id', $info->id)->update($data);
        }
        return $status;
    }

}
